<details><summary>Show Plan</summary>

```

terraform
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
data.aws_ecr_repository.repository: Reading...
module.ecs.data.aws_vpc.vpc: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_ecr_image.service_image: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.redis.data.aws_vpc.vpc: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z09669243E0Q6ZCWCIW2U]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:52357c2019b9ebb609b4ba3d63bdcfc4ca015e47d43dacf65a28d8b66543d3a8]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.redis.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.redis.data.aws_subnets.private_subnets: Reading...
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0dc8dc9dd50d9922f]
module.ecs.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.data.aws_subnets.public_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.redis.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.analytics_bucket will be created
  + resource "aws_s3_bucket" "analytics_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.rpc-proxy.staging.analytics"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_acl.analytics_acl will be created
  + resource "aws_s3_bucket_acl" "analytics_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_public_access_block.analytics_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "analytics_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.analytics_bucket will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "analytics_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.analytics_bucket will be created
  + resource "aws_s3_bucket_versioning" "analytics_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:42" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:40" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 40 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.ecs.aws_iam_policy.analytics_bucket_access will be created
  + resource "aws_iam_policy" "analytics_bucket_access" {
      + arn         = (known after apply)
      + description = "Allows staging_rpc-proxy to read/write from walletconnect.rpc-proxy.staging.analytics"
      + id          = (known after apply)
      + name        = "staging_rpc-proxy_analytics_bucket_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::walletconnect.rpc-proxy.staging.analytics",
                        ]
                      + Sid      = "ListObjectsInAnalyticsBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:DeleteObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                          + "s3:PutObject",
                          + "s3:RestoreObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::walletconnect.rpc-proxy.staging.analytics/*",
                        ]
                      + Sid      = "AllObjectActionsInAnalyticsBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",
                        ]
                      + Sid      = "ListObjectsInGeoipBucket"
                    },
                  + {
                      + Action   = [
                          + "s3:CopyObject",
                          + "s3:GetObject",
                          + "s3:HeadObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",
                        ]
                      + Sid      = "AllObjectActionsInGeoipBucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.bucket-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "bucket-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging_rpc-proxy_ecs_task_execution_role"
    }

Plan: 8 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*